import React, { Component } from 'react';

let professions = ["BTL-менеджер", "ERP-программист", "Event-менеджер", "HTML-верстальщик", "PR-специалист", "SEO-специалист", "Web-дизайнер", "Авиадиспетчер", "Авиаинженер", "Автомеханик", "Автослесарь", "Агент по туризму", "Агроном", "Адвокат", "Административный директор", "Администратор гостиницы", "Администратор ресторана", "Администратор сайта", "Актер", "Актуарий", "Брокер", "Бухгалтер", "Веб-программист", "Верстальщик", "Ветеринар", "Визажист", "Винодел", "Воспитатель детского сада", "Востоковед", "Врач", "Врач скорой помощи", "Врач-онколог", "Генетик", "Генный инженер", "Геодезист", "Геолог", "Геофизик", "Геоэколог", "Гид", "Гид-переводчик", "Искусствовед", "Картограф", "Киновед", "Кинолог", "Кинооператор", "Клипмейкер", "Кондитер", "Консультант по туризму", "Контент-менеджер", "Копирайтер", "Корректор", "Косметолог", "Коуч", "Криминалист", "Критик", "Культуролог", "Ландшафтный дизайнер", "Лингвист", "Лоббист (GR-специалист)", "Логист", "Переводчик", "Пилот", "Писатель", "Повар", "Пожарный", "Политолог", "Политтехнолог", "Полицейский", "Помощник бухгалтера", "Пресс-атташе", "Провизор", "Программист", "Программист PHP", "Продавец-консультант", "Продюсер", "Прокурор", "Прораб", "Психолог", "Психотерапевт", "Радиотехник", "Эколог", "Экономист", "Эксперт-криминалист", "Энергетик", "Этнограф", "Ювелир", "Юрисконсульт", "Юрист", "Юрист-международник"];

class Professions extends Component {
  render() {
    debugger;
    return (<ul className="list-group">
      {professions
        .filter(prof => prof.toUpperCase().indexOf(this.props.value.toUpperCase()) === 0)
        .map((prof, i) => (
          <li className="list-group-item" key={i} onClick={this.props.clickHandler}>
            {<strong>{prof.slice(0, this.props.value.length)}</strong>}{prof.slice(this.props.value.length)}
          </li>))}
    </ul>)
  }
}

export default Professions;